{
  "backend/main.mo": "Actor managing certificate storage and course enrollments with add/remove/verify certificate functions and per-caller enrollment tracking.",
  "feature_evidence.json": "Feature evidence listing required article updates and image additions tied to specific frontend files and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, pages, data modules, and utilities.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide explaining causes of deployment failures and detailing added build configs and scripts for fixing them.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme CSS variables and applying base styles.",
  "frontend/index.html": "HTML entry point setting metadata, icons, root element, and loading the main frontend script.",
  "frontend/scripts/deploy-runner.ts": "Node deployment orchestrator running build steps with retries, logging, secret redaction, and structured reporting.",
  "frontend/scripts/retry.ts": "Utility implementing retry logic with exponential backoff and detailed logging for failing operations.",
  "frontend/src/App.tsx": "Main React app configuring layout, theme, query client, and full route tree for all site pages.",
  "frontend/src/components/HeroCodeLines.tsx": "Displays decorative animated code lines for the hero section using styled divs and spans.",
  "frontend/src/components/ScrollToTopOnRouteChange.tsx": "Subscribes to router navigation events and scrolls the window to the top after each route change.",
  "frontend/src/components/SiteFooter.tsx": "Renders the website footer with brand info, quick links, legal links, and social media icons, including scroll-to-top behavior for same-route clicks.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive site header with navigation links, logo, and a mobile menu with scroll-to-top logic.",
  "frontend/src/components/TextImageCarousel.tsx": "Provides an accessible image-and-text carousel with autoplay, keyboard navigation, and manual controls.",
  "frontend/src/components/TopContactStrip.tsx": "Shows a top contact bar with a promo message, email, phone, and social icons.",
  "frontend/src/data/articles.ts": "Defines the Article interface and exports an array of article objects with metadata and full content.",
  "frontend/src/data/courses.ts": "Defines the Course interface and exports a list of course metadata including descriptions, icons, and pricing.",
  "frontend/src/data/galleryImages.ts": "Defines a GalleryImage interface and exports a list of categorized image metadata for use across the UI.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks to manage Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects the user's reduced‑motion preference using a media query and updates on changes.",
  "frontend/src/hooks/useQueries.ts": "Provides course enrollment queries and mutations using React Query and the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom cybersecurity‑themed CSS variables, components, and utilities for styling.",
  "frontend/src/lib/currency.ts": "Exports a helper to format numbers as INR currency strings.",
  "frontend/src/lib/validation.ts": "Contains simple validation helpers for required fields and email format checking.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission content, a carousel, values list, testimonials, and story section.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article based on slug and handles missing articles with a fallback UI.",
  "frontend/src/pages/ArticlesPage.tsx": "Shows a grid of article cards with metadata and navigation to individual article pages.",
  "frontend/src/pages/CertificateVerificationPage.tsx": "Certificate verification form that calls an actor method to validate a certificate ID and displays success or failure states.",
  "frontend/src/pages/ContactPage.tsx": "Contact form with validation and localStorage-backed submission plus social links display.",
  "frontend/src/pages/CourseDetailPage.tsx": "Course detail and enrollment page with payment simulation, identity checks, and enrollment mutation handling.",
  "frontend/src/pages/CoursesPage.tsx": "Lists all available courses with images, details, and navigation to each course’s detail page.",
  "frontend/src/pages/EnrollmentSuccessPage.tsx": "Displays enrollment confirmation with course info, amount paid, and navigation options.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a gallery grid of training-related images with hover effects.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying hero content, featured courses, tool categories, and a rotating image carousel with navigation buttons.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the site's privacy policy using card sections outlining data collection, usage, security, and user rights.",
  "frontend/src/pages/ResourcesPage.tsx": "Lists categorized cybersecurity resources with icons and descriptions, plus a responsible‑use notice.",
  "frontend/src/pages/TermsPage.tsx": "Displays terms and conditions in card sections covering service use, conduct, liability, and IP rights.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, containers, and enabling plugins for typography, container queries, and animations.",
  "frontend/tsconfig.node.json": "TypeScript config for Node‑side tools enabling ESNext modules, bundler resolution, and including vite.config.ts.",
  "frontend/vite.config.ts": "Vite setup with React, env variable plugins, path aliasing, build chunking, dev server proxying, and dependency optimization.",
  "project_state.json": "Contains high-level project state, architectural notes for the ICP dapp’s React/Motoko setup, known deployment issues, and metadata for all generated image assets."
}