{
  "backend/main.mo": "Motoko actor managing certificate records and per-principal course enrollments with add/remove, verification, and enrollment queries.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "JSON-style mapping of frontend file paths to brief functional descriptions for each component or page.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide explaining root causes of deployment failures and documenting added build and retry-related configuration files.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables for light/dark modes and applying global styles.",
  "frontend/index.html": "Base HTML file loading the React app root and setting meta tags, favicon, and main script.",
  "frontend/scripts/deploy-runner.ts": "Node deployment script orchestrating build and deploy steps with retry logic, secret redaction, and structured logging.",
  "frontend/scripts/retry.ts": "Utility providing exponential backoff retry logic with detailed attempt logging and failure reporting.",
  "frontend/src/App.tsx": "Sets up the main React app layout and configures all routes, including protected dashboard routing with AuthGuard.",
  "frontend/src/components/AccreditationSection.tsx": "Displays an accreditation section with a heading and a wide accreditation image.",
  "frontend/src/components/AuthGuard.tsx": "Protects authenticated routes by redirecting unauthenticated users and storing intended redirects.",
  "frontend/src/components/FloatingWhatsAppButton.tsx": "Renders a fixed WhatsApp contact button linking to a generated WhatsApp URL.",
  "frontend/src/components/HeroCodeLines.tsx": "Shows animated, styled code-like text lines for decorative hero section visuals.",
  "frontend/src/components/ScrollToTopOnRouteChange.tsx": "Scrolls the page to the top on every route change using router subscriptions.",
  "frontend/src/components/SiteFooter.tsx": "Displays the site footer with branding, navigation links, legal links, and social media icons.",
  "frontend/src/components/SiteHeader.tsx": "Renders the site header with navigation, login/logout handling, mobile menu, and identity integration.",
  "frontend/src/components/TextImageCarousel.tsx": "Implements a text-and-image carousel with autoplay, keyboard navigation, and manual controls.",
  "frontend/src/components/TopContactStrip.tsx": "Shows a top contact bar with promo text, email, phone, and social media links.",
  "frontend/src/data/articles.ts": "Defines the Article interface and provides a list of article metadata and content for the site.",
  "frontend/src/data/courses.ts": "Defines the Course interface and exports a catalog of cybersecurity courses with details and pricing.",
  "frontend/src/data/galleryImages.ts": "Exports metadata for gallery images grouped by categories such as branding, courses, and articles.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on the user’s identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for managing Internet Identity authentication, including login state and stored identities.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "React hook that detects if the user prefers reduced motion via a media query.",
  "frontend/src/hooks/useQueries.ts": "Provides hooks for checking course enrollment and triggering enrollment mutations using the actor API.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark cybersecurity themes and custom UI components.",
  "frontend/src/lib/authRedirect.ts": "Implements helpers for storing, retrieving, and clearing post-login navigation targets in sessionStorage.",
  "frontend/src/lib/currency.ts": "Formats numeric values as INR currency strings.",
  "frontend/src/lib/siteContact.ts": "Contains site contact constants and a helper for generating a WhatsApp chat URL.",
  "frontend/src/lib/validation.ts": "Provides simple input validation utilities for required fields and email format.",
  "frontend/src/main.tsx": "Application entry point that configures React Query, Internet Identity, and renders the main app.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission text, values, testimonials, and a text‑image carousel. Uses UI cards and static content about the organization and founder.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a single article based on slug, including image, metadata, and full content. Handles missing articles with a fallback message and navigation controls.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles in a card grid with preview info and navigation to detailed views. Pulls article data from a static articles dataset.",
  "frontend/src/pages/CertificateVerificationPage.tsx": "Provides a form to verify certificate IDs via backend actor and shows success or failure results. Handles input, validation, mutation state, and reset logic.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, localStorage submission, and social links. Shows success/error toasts and tracks form state and errors.",
  "frontend/src/pages/CourseDetailPage.tsx": "Shows detailed information for a specific course, including enrollment flow, payment simulation, and identity checks. Handles navigation, mutations, and UI for payment options.",
  "frontend/src/pages/CoursesPage.tsx": "Displays a grid of available courses with pricing, level, and duration, linking to individual course pages. Uses static course data and standard card layout.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the user's Internet Identity principal inside a styled dashboard card.",
  "frontend/src/pages/EnrollmentSuccessPage.tsx": "Shows course enrollment confirmation with course details, amount paid, and navigation options.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a grid of gallery images with hover effects and category labels.",
  "frontend/src/pages/HomePage.tsx": "Home page with login alert, hero section, featured courses, and promotional content.",
  "frontend/src/pages/PrivacyPage.tsx": "Static privacy policy page outlining data collection, usage, security, and user rights.",
  "frontend/src/pages/ResourcesPage.tsx": "Lists categorized cybersecurity resources and tools with descriptions and responsible-use notice.",
  "frontend/src/pages/TermsPage.tsx": "Static terms and conditions page detailing service use, IP rights, conduct, and liability.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color tokens, extended utilities, animations, and plugin integration for typography, container queries, and animations.",
  "frontend/tsconfig.node.json": "TypeScript config for Vite’s Node-side tooling with ESNext modules and synthetic imports enabled.",
  "frontend/vite.config.ts": "Vite config setting up React, environment variable injection, path aliases, chunk splitting, dev server proxying, and build options.",
  "project_state.json": "Project metadata describing the ICP dapp’s structure, architecture notes, build issues, and generated image assets."
}