{
  "backend/main.mo": "Actor storing certificate IDs in a map with methods to verify, add, and remove certificates using basic validation.",
  "feature_evidence.json": "Feature report listing implemented features, related files, components, and test IDs for course navigation and layout updates.",
  "frontend-file-summaries.txt": "Text file containing prewritten one-line summaries for major frontend components and pages.",
  "frontend/index.css": "Global Tailwind-based styling defining color variables, dark mode values, and base layout rules.",
  "frontend/index.html": "Main HTML entry with metadata, icons, and root div loading the React app.",
  "frontend/src/App.tsx": "Sets up the app’s routing, layout, theming, and query client for all pages.",
  "frontend/src/components/HeroCodeLines.tsx": "Renders animated decorative code-line elements for the hero background.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with branding, navigation links, legal links, and social icons.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, navigation links, and mobile menu toggle.",
  "frontend/src/components/TextImageCarousel.tsx": "A React carousel component that displays slides with images and text, supporting autoplay, keyboard navigation, and reduced-motion preferences.",
  "frontend/src/data/articles.ts": "Defines an Article interface and provides a list of article entries with metadata and full content strings.",
  "frontend/src/data/courses.ts": "Exports a Course interface and an array of course definitions containing details like descriptions, duration, level, and pricing.",
  "frontend/src/data/galleryImages.ts": "Provides a GalleryImage interface and a collection of categorized image metadata used across the site.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context and provider with login, logout, and identity restoration logic using Dfinity AuthClient.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "A hook that returns whether the user has enabled reduced-motion via a media query.",
  "frontend/src/index.css": "Tailwind CSS setup defining light/dark cybersecurity-themed design tokens and custom component styles.",
  "frontend/src/lib/currency.ts": "Formats numbers into INR currency strings using Intl.NumberFormat.",
  "frontend/src/lib/validation.ts": "Provides simple required-field and email-format validation helpers.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and Internet Identity context providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with values, testimonials, and a text-image carousel about the organization.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article based on slug, with metadata, image, and paragraph rendering.",
  "frontend/src/pages/ArticlesPage.tsx": "Shows a grid of article previews with metadata and navigation to detailed views.",
  "frontend/src/pages/CertificateVerificationPage.tsx": "Provides a form to verify certificates via actor API with mutation handling and result display.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, localStorage submission, and social links.",
  "frontend/src/pages/CourseDetailPage.tsx": "Displays detailed course information including description, pricing, metadata, and navigation.",
  "frontend/src/pages/CoursesPage.tsx": "Displays a grid of course cards with images, details, prices, and an enroll button that navigates to each course page.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery grid showing images with hover effects and category labels.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, course highlights, tool categories, and a rotating image-text carousel.",
  "frontend/src/pages/PrivacyPage.tsx": "Shows the site's privacy policy using card sections outlining data collection and user rights.",
  "frontend/src/pages/ResourcesPage.tsx": "Lists categorized cybersecurity resources with icons and item lists, plus a responsible use notice.",
  "frontend/src/pages/TermsPage.tsx": "Displays the terms and conditions divided into card sections covering usage, conduct, and liabilities.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, plugins, and container settings.",
  "project_state.json": "Tracks project metadata including scaffold type, architecture notes, generated assets, and features for an ICP dapp with Motoko backend and React frontend. Contains versioning, image generation records, and high-level project state details."
}