{
  "backend/main.mo": "Motoko canister managing certificate records and per-user course enrollments with add, remove, verify, and enrollment query methods.",
  "feature_evidence.json": "Feature evidence report mapping deployment-related features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files including components, pages, data modules, and utilities.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide explaining root causes of deployment failures and listing added build configs, deployment scripts, and retry logic.",
  "frontend/index.css": "Tailwind CSS base setup defining extensive OKLCH color variables and light/dark theme mappings.",
  "frontend/index.html": "Main HTML entry point defining metadata, icons, and root container loading the React application.",
  "frontend/scripts/deploy-runner.ts": "Node-based deployment orchestrator running build steps with retries, logging, and secret redaction.",
  "frontend/scripts/retry.ts": "Reusable exponential‑backoff retry helper with detailed logging and final failure reporting.",
  "frontend/src/App.tsx": "Sets up the main app layout, initializes React Query and theme provider, and defines all site routes using TanStack Router.",
  "frontend/src/components/HeroCodeLines.tsx": "Displays decorative animated code-like text overlay in the hero section.",
  "frontend/src/components/ScrollToTopOnRouteChange.tsx": "Listens for route changes and automatically scrolls the page to the top on navigation.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, quick links, legal links, and social media icons.",
  "frontend/src/components/SiteHeader.tsx": "Provides the main site header with logo, desktop and mobile navigation, and scroll-to-top behavior on active-route clicks.",
  "frontend/src/components/TextImageCarousel.tsx": "Implements an image-and-text carousel with autoplay, keyboard navigation, and manual controls.",
  "frontend/src/components/TopContactStrip.tsx": "Displays a top bar with a promo message, contact info, and social media icons.",
  "frontend/src/data/articles.ts": "Exports article metadata and full content for use in article listing and detail pages.",
  "frontend/src/data/courses.ts": "Defines the Course interface and exports a list of cybersecurity course objects with metadata.",
  "frontend/src/data/galleryImages.ts": "Defines GalleryImage type and exports categorized image metadata for courses, articles, and branding.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on Internet Identity and invalidates queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and utilities for managing Internet Identity authentication via AuthClient.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that returns whether the user prefers reduced motion using a media query listener.",
  "frontend/src/hooks/useQueries.ts": "Provides enrollment-related React Query hooks to check and update course enrollment through the actor.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark cybersecurity themes and custom UI components.",
  "frontend/src/lib/currency.ts": "Exports a helper to format numbers as INR currency strings.",
  "frontend/src/lib/validation.ts": "Provides basic validation helpers for required fields and email format.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with values, testimonials, and carousel content about the organization.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays an article's details using route params, with navigation and formatted article content.",
  "frontend/src/pages/ArticlesPage.tsx": "Displays a grid of article cards with metadata and images, allowing navigation to individual article pages. Uses article data and router navigation.",
  "frontend/src/pages/CertificateVerificationPage.tsx": "Provides a form to verify certificate IDs via a backend actor and shows success or failure states. Handles input validation, mutation state, and reset actions.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and localStorage-based submission. Also includes social media links and user feedback via toast messages.",
  "frontend/src/pages/CourseDetailPage.tsx": "Shows detailed information for a selected course and handles enrollment through simulated payment and backend mutation. Supports login checks, payment modal flow, and navigation to success page.",
  "frontend/src/pages/CoursesPage.tsx": "Lists all available courses with brief details and pricing. Each course links to its detailed page for enrollment.",
  "frontend/src/pages/EnrollmentSuccessPage.tsx": "Displays confirmation details after successful course enrollment, including amount paid and course info. Provides navigation back to course list or the course detail page.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a responsive gallery of images with hover effects and category labels. Uses predefined gallery image data.",
  "frontend/src/pages/HomePage.tsx": "Home page component with hero section, course carousel, featured content, and navigation buttons.",
  "frontend/src/pages/PrivacyPage.tsx": "Static privacy policy page outlining data collection, usage, security, and user rights.",
  "frontend/src/pages/ResourcesPage.tsx": "Displays categorized cybersecurity resources with icons, lists, and a responsible‑use notice.",
  "frontend/src/pages/TermsPage.tsx": "Static terms and conditions page describing service use, conduct, liability, and policy changes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, components, animations, and plugin setup.",
  "frontend/tsconfig.node.json": "TypeScript config for Node builds specifying module resolution and included Vite config.",
  "frontend/vite.config.ts": "Vite build config with React plugin, environment variable support, aliases, proxy, and chunk splitting.",
  "project_state.json": "Tracks project version, architecture notes, issues, and generated image metadata for an ICP dapp with a Motoko backend and React frontend."
}