{
  "backend/main.mo": "Motoko actor storing certificate IDs in a map with methods to verify, add, and remove certificates, trapping on duplicates or missing entries.",
  "feature_evidence.json": "JSON report describing a feature update to replace placeholder social links with real URLs and listing affected frontend files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for multiple frontend files including pages, components, data modules, and styles.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, dark mode values, and base element styling.",
  "frontend/index.html": "HTML entry point setting SEO metadata, icons, and loading the main React script.",
  "frontend/src/App.tsx": "Main React app configuring routes, global layout, theming, and query client with header and footer wrappers.",
  "frontend/src/components/HeroCodeLines.tsx": "Decorative component rendering animated cyber-themed code lines over the hero section.",
  "frontend/src/components/SiteFooter.tsx": "Footer showing brand info, navigation, legal links, and social icons using updated URLs for major platforms.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, navigation links, and mobile menu toggle using TanStack Router.",
  "frontend/src/components/TextImageCarousel.tsx": "Interactive text-image carousel with autoplay, keyboard navigation, and reduced‑motion support.",
  "frontend/src/data/articles.ts": "Defines Article type and exports a list of article entries with metadata and full content.",
  "frontend/src/data/courses.ts": "Defines Course type and provides a catalog of cybersecurity courses with details and pricing.",
  "frontend/src/data/galleryImages.ts": "Exports categorized image metadata for use in gallery and UI displays.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login state, and identity persistence.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Hook that detects the user's reduced‑motion preference via a media query.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark cybersecurity themes and custom UI component styling.",
  "frontend/src/lib/currency.ts": "Provides a helper to format numbers as INR currency using Intl.NumberFormat.",
  "frontend/src/lib/validation.ts": "Contains simple required-field and email format validation functions.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with values, testimonials, and a carousel highlighting the organization’s mission and story.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article based on slug, including image, metadata, and formatted content.",
  "frontend/src/pages/ArticlesPage.tsx": "Lists all articles in a card grid with previews and navigation to detail pages.",
  "frontend/src/pages/CertificateVerificationPage.tsx": "Allows users to enter a certificate ID and verifies it through an actor with loading and result states.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, localStorage submission, and social links.",
  "frontend/src/pages/CourseDetailPage.tsx": "Shows detailed course info including description, image, pricing, and metadata, with navigation back to the courses list.",
  "frontend/src/pages/CoursesPage.tsx": "Displays a grid of course cards with images, details, prices, and navigation to individual course pages.",
  "frontend/src/pages/GalleryPage.tsx": "Renders a gallery grid of images with hover effects and category labels.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with a hero section, featured courses, tool categories, and a rotating content carousel.",
  "frontend/src/pages/PrivacyPage.tsx": "Shows the site's privacy policy using structured card sections for key policy points.",
  "frontend/src/pages/ResourcesPage.tsx": "Lists categorized cybersecurity resources with icons and itemized content plus a responsible-use notice.",
  "frontend/src/pages/TermsPage.tsx": "Presents the terms and conditions in card-based sections detailing usage, rights, and responsibilities.",
  "frontend/tailwind.config.js": "Configures TailwindCSS themes, colors, container settings, and custom animations for the frontend.",
  "project_state.json": "Stores project metadata, architecture notes, image generation records, and existing feature definitions for the ICP dapp scaffold."
}