{
  "kind": "build_request",
  "title": "Add requested additional articles to the Articles page",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Update the Articles content data so the additional articles requested by the user are included in the Articles list and can be opened in the Article Detail view. Add each new article to frontend/src/data/articles.ts with a unique slug, English title, preview, full content, author, date, and a valid image path.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add this articles in articles page"
        ]
      },
      "acceptanceCriteria": [
        "New article objects exist in frontend/src/data/articles.ts and follow the existing Article interface shape (slug, title, preview, content, image, date, author).",
        "Each new article has a unique slug and does not break existing routes or article lookup by slug.",
        "The /articles page renders cards for the newly added articles alongside existing ones.",
        "Navigating to /articles/$slug for each newly added article shows the correct title, image, metadata, and full content without runtime errors."
      ]
    },
    {
      "id": "REQ-36",
      "text": "If any of the newly added articles require new images, add those image files as static frontend assets under frontend/public/assets/ (or frontend/public/assets/generated if generated) and reference them via the Article.image field so images load correctly on both the Articles list and Article Detail pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add this articles in articles page"
        ]
      },
      "acceptanceCriteria": [
        "For every newly added article, the Article.image field points to an existing static file path that loads successfully in the browser.",
        "No broken image links appear on /articles or on any /articles/$slug page for the newly added articles."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn/ui).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Keep all user-facing text for the newly added articles in English."
  ],
  "nonGoals": [
    "No backend changes or persistence for articles (articles remain frontend static content).",
    "No new routing patterns; continue using the existing /articles and /articles/$slug routes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}