{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add additional articles and any required images to Articles pages",
  "requirements": [
    {
      "id": "REQ-35",
      "summary": "Add the user-requested additional articles to the static Articles dataset so they appear on /articles and render correctly on /articles/$slug.",
      "acceptanceCriteria": [
        "New article objects exist in frontend/src/data/articles.ts and follow the existing Article interface shape (slug, title, preview, content, image, date, author).",
        "Each new article has a unique slug and does not break existing routes or article lookup by slug.",
        "The /articles page renders cards for the newly added articles alongside existing ones.",
        "Navigating to /articles/$slug for each newly added article shows the correct title, image, metadata, and full content without runtime errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/articles.ts",
          "operation": "modify",
          "description": "Append the additional user-requested article objects to the exported articles array, ensuring each includes slug/title/preview/content/author/date/image (English text only), uses unique slugs, and that image paths point to valid static assets."
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Ensure every newly added article references a valid static image asset and add any missing image files under frontend/public/assets (or frontend/public/assets/generated if generated).",
      "acceptanceCriteria": [
        "For every newly added article, the Article.image field points to an existing static file path that loads successfully in the browser.",
        "No broken image links appear on /articles or on any /articles/$slug page for the newly added articles."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/whatsapp-image-2026-01-17-94554.jpeg",
          "operation": "create",
          "description": "Add the new static image asset (from the provided workspace asset \"WhatsApp Image 2026-01-17 at 9.45.54 AM.jpeg\") under frontend/public/assets/ so it can be referenced by new Article.image fields."
        },
        {
          "path": "frontend/src/data/articles.ts",
          "operation": "modify",
          "description": "Set/adjust the Article.image field for any newly added articles that require new images to reference the added static asset(s) under frontend/public/assets (or existing assets under frontend/public/assets/generated), ensuring no broken images on list/detail views."
        }
      ]
    }
  ]
}